name: "ensemble_preprocess_fil_postprocess"
platform: "ensemble"
max_batch_size: 882352
input [
  {
    name: "raw_data"
    data_type: TYPE_STRING
    dims: [ 14 ]
  }
]
output [
  {
    name: "postprocessed_predictions"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessing"
      model_version: -1
      input_map {
        key: "INPUT"
        value: "raw_data"
      }
      output_map {
        key: "OUTPUT"
        value: "preprocessed_data"
      }
    },
    {
      model_name: "fil"
      model_version: -1
      input_map {
        key: "input__0"
        value: "preprocessed_data"
      }
      output_map {
        key: "output__0"
        value: "predictions"
      }
    },
    {
      model_name: "postprocessing"
      model_version: -1
      input_map {
        key: "CLASS_IDX"
        value: "predictions"
      }
      output_map {
        key: "CLASS_LABEL"
        value: "postprocessed_predictions"
      }
    }
  ]
}